espressif/esp-idf/components/soc/esp32c61/register/soc/pvt_struct.h
/** Type of dbias_channel1_sel register
 *  needs desc
 */
typedef union {
    struct {
        /** dbias_channel1_cfg : R/W; bitpos: [16:0]; default: 0;
         *  needs field desc
         */
        uint32_t dbias_channel1_cfg:17;
        uint32_t reserved_17:15;
    };
    uint32_t val;
} pvt_dbias_channel1_sel_reg_t;

/** Type of dbias_channel2_sel register
 *  needs desc
 */
typedef union {
    struct {
        /** dbias_channel2_cfg : R/W; bitpos: [16:0]; default: 0;
         *  needs field desc
         */
        uint32_t dbias_channel2_cfg:17;
        uint32_t reserved_17:15;
    };
    uint32_t val;
} pvt_dbias_channel2_sel_reg_t;

/** Type of dbias_channel3_sel register
 *  needs desc
 */
typedef union {
    struct {
        /** dbias_channel3_cfg : R/W; bitpos: [16:0]; default: 0;
         *  needs field desc
         */
        uint32_t dbias_channel3_cfg:17;
        uint32_t reserved_17:15;
    };
    uint32_t val;
} pvt_dbias_channel3_sel_reg_t;

/** Type of dbias_channel4_sel register
 *  needs desc
 */
typedef union {
    struct {
        /** dbias_channel4_cfg : R/W; bitpos: [16:0]; default: 0;
         *  needs field desc
         */
        uint32_t dbias_channel4_cfg:17;
        uint32_t reserved_17:15;
    };
    uint32_t val;
} pvt_dbias_channel4_sel_reg_t;

/** Type of dbias_cmd0 register
 *  needs desc
 */
typedef union {
    struct {
        /** dbias_cmd0 : R/W; bitpos: [16:0]; default: 0;
         *  needs field desc
         */
        uint32_t dbias_cmd0:17;
        uint32_t reserved_17:15;
    };
    uint32_t val;
} pvt_dbias_cmd0_reg_t;

/** Type of dbias_cmd1 register
 *  needs desc
 */
typedef union {
    struct {
        /** dbias_cmd1 : R/W; bitpos: [16:0]; default: 0;
         *  needs field desc
         */
        uint32_t dbias_cmd1:17;
        uint32_t reserved_17:15;
    };
    uint32_t val;
} pvt_dbias_cmd1_reg_t;

/** Type of dbias_cmd2 register
 *  needs desc
 */
typedef union {
    struct {
        /** dbias_cmd2 : R/W; bitpos: [16:0]; default: 0;
         *  needs field desc
         */
        uint32_t dbias_cmd2:17;
        uint32_t reserved_17:15;
    };
    uint32_t val;
} pvt_dbias_cmd2_reg_t;

/** Type of dbias_cmd3 register
 *  needs desc
 */
typedef union {
    struct {
        /** dbias_cmd3 : R/W; bitpos: [16:0]; default: 0;
         *  needs field desc
         */
        uint32_t dbias_cmd3:17;
        uint32_t reserved_17:15;
    };
    uint32_t val;
} pvt_dbias_cmd3_reg_t;

/** Type of dbias_cmd4 register
 *  needs desc
 */
typedef union {
    struct {
        /** dbias_cmd4 : R/W; bitpos: [16:0]; default: 0;
         *  needs field desc
         */
        uint32_t dbias_cmd4:17;
        uint32_t reserved_17:15;
    };
    uint32_t val;
} pvt_dbias_cmd4_reg_t;

/** Type of dbias_timer register
 *  needs desc
 */
typedef union {
    struct {
        uint32_t reserved_0:15;
        /** timer_target : R/W; bitpos: [30:15]; default: 65535;
         *  needs field desc
         */
        uint32_t timer_target:16;
        /** timer_en : R/W; bitpos: [31]; default: 0;
         *  needs field desc
         */
        uint32_t timer_en:1;
    };
    uint32_t val;
} pvt_dbias_timer_reg_t;

/** Type of comb_pd_site0_unit0_vt0_conf1 register
 *  needs desc
 */
typedef union {
    struct {
        /** monitor_en_vt0_pd_site0_unit0 : R/W; bitpos: [0]; default: 0;
         *  needs field desc
         */
        uint32_t monitor_en_vt0_pd_site0_unit0:1;
        /** timing_err_cnt_clr_vt0_pd_site0_unit0 : WT; bitpos: [1]; default: 0;
         *  needs field desc
         */
        uint32_t timing_err_cnt_clr_vt0_pd_site0_unit0:1;
        /** delay_limit_vt0_pd_site0_unit0 : R/W; bitpos: [9:2]; default: 20;
         *  needs field desc
         */
        uint32_t delay_limit_vt0_pd_site0_unit0:8;
        uint32_t reserved_10:13;
        /** delay_num_o_vt0_pd_site0_unit0 : RO; bitpos: [30:23]; default: 0;
         *  needs field desc
         */
        uint32_t delay_num_o_vt0_pd_site0_unit0:8;
        /** timing_err_vt0_pd_site0_unit0 : RO; bitpos: [31]; default: 0;
         *  needs field desc
         */
        uint32_t timing_err_vt0_pd_site0_unit0:1;
    };
    uint32_t val;
} pvt_comb_pd_site0_unit0_vt0_conf1_reg_t;

/** Type of comb_pd_site0_unit1_vt0_conf1 register
 *  needs desc
 */
typedef union {
    struct {
        /** monitor_en_vt0_pd_site0_unit1 : R/W; bitpos: [0]; default: 0;
         *  needs field desc
         */
        uint32_t monitor_en_vt0_pd_site0_unit1:1;
        /** timing_err_cnt_clr_vt0_pd_site0_unit1 : WT; bitpos: [1]; default: 0;
         *  needs field desc
         */
        uint32_t timing_err_cnt_clr_vt0_pd_site0_unit1:1;
        /** delay_limit_vt0_pd_site0_unit1 : R/W; bitpos: [9:2]; default: 20;
         *  needs field desc
         */
        uint32_t delay_limit_vt0_pd_site0_unit1:8;
        uint32_t reserved_10:13;
        /** delay_num_o_vt0_pd_site0_unit1 : RO; bitpos: [30:23]; default: 0;
         *  needs field desc
         */
        uint32_t delay_num_o_vt0_pd_site0_unit1:8;
        /** timing_err_vt0_pd_site0_unit1 : RO; bitpos: [31]; default: 0;
         *  needs field desc
         */
        uint32_t timing_err_vt0_pd_site0_unit1:1;
    };
    uint32_t val;
} pvt_comb_pd_site0_unit1_vt0_conf1_reg_t;

/** Type of comb_pd_site0_unit2_vt0_conf1 register
 *  needs desc
 */
typedef union {
    struct {
        /** monitor_en_vt0_pd_site0_unit2 : R/W; bitpos: [0]; default: 0;
         *  needs field desc
         */
        uint32_t monitor_en_vt0_pd_site0_unit2:1;
        /** timing_err_cnt_clr_vt0_pd_site0_unit2 : WT; bitpos: [1]; default: 0;
         *  needs field desc
         */
        uint32_t timing_err_cnt_clr_vt0_pd_site0_unit2:1;
        /** delay_limit_vt0_pd_site0_unit2 : R/W; bitpos: [9:2]; default: 20;
         *  needs field desc
         */
        uint32_t delay_limit_vt0_pd_site0_unit2:8;
        uint32_t reserved_10:13;
        /** delay_num_o_vt0_pd_site0_unit2 : RO; bitpos: [30:23]; default: 0;
         *  needs field desc
         */
        uint32_t delay_num_o_vt0_pd_site0_unit2:8;
        /** timing_err_vt0_pd_site0_unit2 : RO; bitpos: [31]; default: 0;
         *  needs field desc
         */
        uint32_t timing_err_vt0_pd_site0_unit2:1;
    };
    uint32_t val;
} pvt_comb_pd_site0_unit2_vt0_conf1_reg_t;

/** Type of comb_pd_site0_unit3_vt0_conf1 register
 *  needs desc
 */
typedef union {
    struct {
        /** monitor_en_vt0_pd_site0_unit3 : R/W; bitpos: [0]; default: 0;
         *  needs field desc
         */
        uint32_t monitor_en_vt0_pd_site0_unit3:1;
        /** timing_err_cnt_clr_vt0_pd_site0_unit3 : WT; bitpos: [1]; default: 0;
         *  needs field desc
         */
        uint32_t timing_err_cnt_clr_vt0_pd_site0_unit3:1;
        /** delay_limit_vt0_pd_site0_unit3 : R/W; bitpos: [9:2]; default: 20;
         *  needs field desc
         */
        uint32_t delay_limit_vt0_pd_site0_unit3:8;
        uint32_t reserved_10:13;
        /** delay_num_o_vt0_pd_site0_unit3 : RO; bitpos: [30:23]; default: 0;
         *  needs field desc
         */
        uint32_t delay_num_o_vt0_pd_site0_unit3:8;
        /** timing_err_vt0_pd_site0_unit3 : RO; bitpos: [31]; default: 0;
         *  needs field desc
         */
        uint32_t timing_err_vt0_pd_site0_unit3:1;
    };
    uint32_t val;
} pvt_comb_pd_site0_unit3_vt0_conf1_reg_t;

