espressif/esp-idf/components/soc/esp32c61/register/soc/pvt_struct.h
/** Type of comb_pd_site1_unit0_vt1_conf2 register
 *  needs desc
 */
typedef union {
    struct {
        /** monitor_edg_mod_vt1_pd_site1_unit0 : R/W; bitpos: [1:0]; default: 0;
         *  needs field desc
         */
        uint32_t monitor_edg_mod_vt1_pd_site1_unit0:2;
        uint32_t reserved_2:13;
        /** delay_ovf_vt1_pd_site1_unit0 : RO; bitpos: [15]; default: 0;
         *  needs field desc
         */
        uint32_t delay_ovf_vt1_pd_site1_unit0:1;
        /** timing_err_cnt_o_vt1_pd_site1_unit0 : RO; bitpos: [31:16]; default: 0;
         *  needs field desc
         */
        uint32_t timing_err_cnt_o_vt1_pd_site1_unit0:16;
    };
    uint32_t val;
} pvt_comb_pd_site1_unit0_vt1_conf2_reg_t;

/** Type of comb_pd_site1_unit1_vt1_conf2 register
 *  needs desc
 */
typedef union {
    struct {
        /** monitor_edg_mod_vt1_pd_site1_unit1 : R/W; bitpos: [1:0]; default: 0;
         *  needs field desc
         */
        uint32_t monitor_edg_mod_vt1_pd_site1_unit1:2;
        uint32_t reserved_2:13;
        /** delay_ovf_vt1_pd_site1_unit1 : RO; bitpos: [15]; default: 0;
         *  needs field desc
         */
        uint32_t delay_ovf_vt1_pd_site1_unit1:1;
        /** timing_err_cnt_o_vt1_pd_site1_unit1 : RO; bitpos: [31:16]; default: 0;
         *  needs field desc
         */
        uint32_t timing_err_cnt_o_vt1_pd_site1_unit1:16;
    };
    uint32_t val;
} pvt_comb_pd_site1_unit1_vt1_conf2_reg_t;

/** Type of comb_pd_site1_unit2_vt1_conf2 register
 *  needs desc
 */
typedef union {
    struct {
        /** monitor_edg_mod_vt1_pd_site1_unit2 : R/W; bitpos: [1:0]; default: 0;
         *  needs field desc
         */
        uint32_t monitor_edg_mod_vt1_pd_site1_unit2:2;
        uint32_t reserved_2:13;
        /** delay_ovf_vt1_pd_site1_unit2 : RO; bitpos: [15]; default: 0;
         *  needs field desc
         */
        uint32_t delay_ovf_vt1_pd_site1_unit2:1;
        /** timing_err_cnt_o_vt1_pd_site1_unit2 : RO; bitpos: [31:16]; default: 0;
         *  needs field desc
         */
        uint32_t timing_err_cnt_o_vt1_pd_site1_unit2:16;
    };
    uint32_t val;
} pvt_comb_pd_site1_unit2_vt1_conf2_reg_t;

/** Type of comb_pd_site1_unit3_vt1_conf2 register
 *  needs desc
 */
typedef union {
    struct {
        /** monitor_edg_mod_vt1_pd_site1_unit3 : R/W; bitpos: [1:0]; default: 0;
         *  needs field desc
         */
        uint32_t monitor_edg_mod_vt1_pd_site1_unit3:2;
        uint32_t reserved_2:13;
        /** delay_ovf_vt1_pd_site1_unit3 : RO; bitpos: [15]; default: 0;
         *  needs field desc
         */
        uint32_t delay_ovf_vt1_pd_site1_unit3:1;
        /** timing_err_cnt_o_vt1_pd_site1_unit3 : RO; bitpos: [31:16]; default: 0;
         *  needs field desc
         */
        uint32_t timing_err_cnt_o_vt1_pd_site1_unit3:16;
    };
    uint32_t val;
} pvt_comb_pd_site1_unit3_vt1_conf2_reg_t;

/** Type of comb_pd_site1_unit0_vt2_conf2 register
 *  needs desc
 */
typedef union {
    struct {
        /** monitor_edg_mod_vt2_pd_site1_unit0 : R/W; bitpos: [1:0]; default: 0;
         *  needs field desc
         */
        uint32_t monitor_edg_mod_vt2_pd_site1_unit0:2;
        uint32_t reserved_2:13;
        /** delay_ovf_vt2_pd_site1_unit0 : RO; bitpos: [15]; default: 0;
         *  needs field desc
         */
        uint32_t delay_ovf_vt2_pd_site1_unit0:1;
        /** timing_err_cnt_o_vt2_pd_site1_unit0 : RO; bitpos: [31:16]; default: 0;
         *  needs field desc
         */
        uint32_t timing_err_cnt_o_vt2_pd_site1_unit0:16;
    };
    uint32_t val;
} pvt_comb_pd_site1_unit0_vt2_conf2_reg_t;

/** Type of comb_pd_site1_unit1_vt2_conf2 register
 *  needs desc
 */
typedef union {
    struct {
        /** monitor_edg_mod_vt2_pd_site1_unit1 : R/W; bitpos: [1:0]; default: 0;
         *  needs field desc
         */
        uint32_t monitor_edg_mod_vt2_pd_site1_unit1:2;
        uint32_t reserved_2:13;
        /** delay_ovf_vt2_pd_site1_unit1 : RO; bitpos: [15]; default: 0;
         *  needs field desc
         */
        uint32_t delay_ovf_vt2_pd_site1_unit1:1;
        /** timing_err_cnt_o_vt2_pd_site1_unit1 : RO; bitpos: [31:16]; default: 0;
         *  needs field desc
         */
        uint32_t timing_err_cnt_o_vt2_pd_site1_unit1:16;
    };
    uint32_t val;
} pvt_comb_pd_site1_unit1_vt2_conf2_reg_t;

/** Type of comb_pd_site1_unit2_vt2_conf2 register
 *  needs desc
 */
typedef union {
    struct {
        /** monitor_edg_mod_vt2_pd_site1_unit2 : R/W; bitpos: [1:0]; default: 0;
         *  needs field desc
         */
        uint32_t monitor_edg_mod_vt2_pd_site1_unit2:2;
        uint32_t reserved_2:13;
        /** delay_ovf_vt2_pd_site1_unit2 : RO; bitpos: [15]; default: 0;
         *  needs field desc
         */
        uint32_t delay_ovf_vt2_pd_site1_unit2:1;
        /** timing_err_cnt_o_vt2_pd_site1_unit2 : RO; bitpos: [31:16]; default: 0;
         *  needs field desc
         */
        uint32_t timing_err_cnt_o_vt2_pd_site1_unit2:16;
    };
    uint32_t val;
} pvt_comb_pd_site1_unit2_vt2_conf2_reg_t;

/** Type of comb_pd_site1_unit3_vt2_conf2 register
 *  needs desc
 */
typedef union {
    struct {
        /** monitor_edg_mod_vt2_pd_site1_unit3 : R/W; bitpos: [1:0]; default: 0;
         *  needs field desc
         */
        uint32_t monitor_edg_mod_vt2_pd_site1_unit3:2;
        uint32_t reserved_2:13;
        /** delay_ovf_vt2_pd_site1_unit3 : RO; bitpos: [15]; default: 0;
         *  needs field desc
         */
        uint32_t delay_ovf_vt2_pd_site1_unit3:1;
        /** timing_err_cnt_o_vt2_pd_site1_unit3 : RO; bitpos: [31:16]; default: 0;
         *  needs field desc
         */
        uint32_t timing_err_cnt_o_vt2_pd_site1_unit3:16;
    };
    uint32_t val;
} pvt_comb_pd_site1_unit3_vt2_conf2_reg_t;

/** Type of comb_pd_site2_unit0_vt0_conf2 register
 *  needs desc
 */
typedef union {
    struct {
        /** monitor_edg_mod_vt0_pd_site2_unit0 : R/W; bitpos: [1:0]; default: 0;
         *  needs field desc
         */
        uint32_t monitor_edg_mod_vt0_pd_site2_unit0:2;
        uint32_t reserved_2:13;
        /** delay_ovf_vt0_pd_site2_unit0 : RO; bitpos: [15]; default: 0;
         *  needs field desc
         */
        uint32_t delay_ovf_vt0_pd_site2_unit0:1;
        /** timing_err_cnt_o_vt0_pd_site2_unit0 : RO; bitpos: [31:16]; default: 0;
         *  needs field desc
         */
        uint32_t timing_err_cnt_o_vt0_pd_site2_unit0:16;
    };
    uint32_t val;
} pvt_comb_pd_site2_unit0_vt0_conf2_reg_t;

/** Type of comb_pd_site2_unit1_vt0_conf2 register
 *  needs desc
 */
typedef union {
    struct {
        /** monitor_edg_mod_vt0_pd_site2_unit1 : R/W; bitpos: [1:0]; default: 0;
         *  needs field desc
         */
        uint32_t monitor_edg_mod_vt0_pd_site2_unit1:2;
        uint32_t reserved_2:13;
        /** delay_ovf_vt0_pd_site2_unit1 : RO; bitpos: [15]; default: 0;
         *  needs field desc
         */
        uint32_t delay_ovf_vt0_pd_site2_unit1:1;
        /** timing_err_cnt_o_vt0_pd_site2_unit1 : RO; bitpos: [31:16]; default: 0;
         *  needs field desc
         */
        uint32_t timing_err_cnt_o_vt0_pd_site2_unit1:16;
    };
    uint32_t val;
} pvt_comb_pd_site2_unit1_vt0_conf2_reg_t;

/** Type of comb_pd_site2_unit2_vt0_conf2 register
 *  needs desc
 */
typedef union {
    struct {
        /** monitor_edg_mod_vt0_pd_site2_unit2 : R/W; bitpos: [1:0]; default: 0;
         *  needs field desc
         */
        uint32_t monitor_edg_mod_vt0_pd_site2_unit2:2;
        uint32_t reserved_2:13;
        /** delay_ovf_vt0_pd_site2_unit2 : RO; bitpos: [15]; default: 0;
         *  needs field desc
         */
        uint32_t delay_ovf_vt0_pd_site2_unit2:1;
        /** timing_err_cnt_o_vt0_pd_site2_unit2 : RO; bitpos: [31:16]; default: 0;
         *  needs field desc
         */
        uint32_t timing_err_cnt_o_vt0_pd_site2_unit2:16;
    };
    uint32_t val;
} pvt_comb_pd_site2_unit2_vt0_conf2_reg_t;

/** Type of comb_pd_site2_unit3_vt0_conf2 register
 *  needs desc
 */
typedef union {
    struct {
        /** monitor_edg_mod_vt0_pd_site2_unit3 : R/W; bitpos: [1:0]; default: 0;
         *  needs field desc
         */
        uint32_t monitor_edg_mod_vt0_pd_site2_unit3:2;
        uint32_t reserved_2:13;
        /** delay_ovf_vt0_pd_site2_unit3 : RO; bitpos: [15]; default: 0;
         *  needs field desc
         */
        uint32_t delay_ovf_vt0_pd_site2_unit3:1;
        /** timing_err_cnt_o_vt0_pd_site2_unit3 : RO; bitpos: [31:16]; default: 0;
         *  needs field desc
         */
        uint32_t timing_err_cnt_o_vt0_pd_site2_unit3:16;
    };
    uint32_t val;
} pvt_comb_pd_site2_unit3_vt0_conf2_reg_t;

